pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi.globals.c
// bl602_demo_wifi.globals.c
// Generated by decompiling bl602_demo_wifi.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_wifi.h"

Eq_2 g_a0000[16000000];
Eq_2 g_a0001[5];
Eq_2 g_a0002[16000000];
Eq_2 g_a0003[];
Eq_2 g_a0004[];
Eq_2 g_t0005;
Eq_2 g_t0006;
Eq_2 g_t0007;
Eq_2 g_t0008;
Eq_2 g_t0009;
Eq_2 g_t000A;
Eq_2 g_t000B;
Eq_69455 g_a000C[];
Eq_2 g_t000D;
Eq_2 g_t000E;
Eq_2 g_t000F;
Eq_2 g_t0010;
Eq_2 g_t0011;
Eq_2 g_t0012;
Eq_2 g_t0013;
Eq_2 g_t0014;
Eq_2 g_t0015;
Eq_2 g_t0016;
Eq_2 g_t0017;
Eq_2 g_t0018;
Eq_2 g_t0019;
Eq_2 g_t001A;
Eq_2 g_t001B;
Eq_2 g_t001C;
Eq_2 g_t001D;
Eq_160476 g_t001E;
Eq_2 g_t001F;
Eq_2 g_a0020[];
Eq_2 g_t0021;
Eq_2 g_t0022;
Eq_2 g_t0023;
Eq_2 g_t0024;
Eq_2 g_t0025;
ptr32 g_ptr0026;
Eq_2 g_t0027;
Eq_2 g_t0028;
Eq_2 g_t0029;
Eq_2 g_t002A;
Eq_2 g_t002B;
struct Eq_59549 * g_ptr002C;
Eq_2 g_t002D;
word32 g_dw002E;
Eq_197168 g_t002F;
Eq_31478 g_t0030;
Eq_2 g_t0031;
Eq_2 g_t0032;
Eq_2 g_t0033;
Eq_2 g_t0034;
Eq_2 g_t0035;
Eq_2 g_t0036;
Eq_2 g_t0037;
Eq_2 g_t0038;
Eq_2 g_t0039;
Eq_2 g_t003A;
Eq_2 g_t003C;
Eq_2 g_t003D;
Eq_2 g_t003F;
Eq_2 g_t0040;
Eq_2 g_t0041;
struct Eq_277262 * g_ptr0042;
Eq_2 g_t0043;
word32 g_dw0044;
Eq_2 g_t0045;
Eq_160476 g_t0046;
Eq_2 g_t0048;
word32 g_dw0049;
Eq_362986 g_a004C[];
Eq_2 g_t004D;
Eq_286776 g_t004E;
Eq_160476 g_t004F;
Eq_2 g_a0050[16000000];
Eq_2 g_t0051;
Eq_120302 g_t0057;
Eq_2 g_t0058;
word32 g_dw0059;
struct Eq_158155 * g_ptr005A;
struct Eq_158155 * g_ptr005B;
Eq_2 g_t005C;
word32 g_dw005D;
Eq_69710 g_t005F;
ptr32 g_ptr0060;
Eq_2 g_t0061;
byte g_b0062;
byte g_b0063;
byte g_b0064;
Eq_2 g_t0065;
Eq_2 g_t0066;
Eq_2 g_t0068;
word32 g_dw0069;
Eq_2 g_t006A;
Eq_2 g_t006B;
word32 g_a006C[];
Eq_140593 g_t006D;
Eq_125590 g_t006E;
Eq_2 g_t0071;
Eq_2 g_t0073;
Eq_2 g_t0074;
struct Eq_55605 * g_ptr0075;
struct Eq_276987 * g_ptr0076;
uint16 g_w0077;
Eq_94076 g_t0078;
Eq_2 g_t0079;
Eq_2 g_t007A;
word32 g_dw007B;
Eq_2 g_t007C;
word32 g_dw007D;
uint16 g_w007F;
Eq_2 g_t0080;
Eq_2 g_t0084;
uint16 g_w0088;
word32 g_dw00A0;
word32 g_dw00A5;
Eq_2 g_t00AA;
word32 g_dw00AC;
word32 g_dw00AD;
Eq_31100 g_t00B0;
word32 g_dw00BF;
Eq_31100 g_t00C0;
Eq_2 g_t00C8;
Eq_2 g_t00CA;
word32 g_dw00CB;
Eq_2 g_t00CC;
Eq_2 g_t00D0;
<anonymous> * g_ptr00D4;
struct Eq_50194 * g_ptr00E0;
byte g_a00EF[];
Eq_198970 g_t00F0;
Eq_8261 g_t00FF;
word32 g_dw0100;
Eq_42427 g_t0111;
word32 g_dw011C;
Eq_363025 g_a0120[];
Eq_47150 g_t014D;
struct Eq_78002 * g_ptr0167;
ptr32 g_ptr0190;
Eq_69298 g_t01DC;
Eq_195397 g_t01F4;
Eq_47150 g_t0200;
Eq_2 g_t0208;
Eq_2 g_t022C;
Eq_2 g_t0234;
Eq_2 g_t0238;
struct Eq_26613 * g_ptr0330;
Eq_2 g_t03A2;
word32 g_dw03AE;
Eq_316458 g_t0400;
Eq_2 g_t0414;
Eq_2 g_t0450;
Eq_30907 g_t05D8;
byte g_b05EF;
Eq_99963 g_t07FF;
word32 g_dw080F;
word32 g_dw1484;
Eq_286776 g_t4345;
Eq_2 g_t2F336;
ptr32 g_ptr36004;
Eq_2 g_t40017;
word32 g_dw40071;
Eq_2 g_t40075;
word32 g_dw50005;
Eq_2 g_t5E442;
word32 g_dw60003;
Eq_2 g_t80016;
word32 g_dw9280C;
word32 g_dwA007C;
Eq_2 g_tC0016;
word32 g_dwF424C;
word32 g_dwF427C;
Eq_101901 g_tFAC05;
struct Eq_125609 * g_ptr100100;
word32 g_dw1E8494;
word32 g_dw1E84B4;
word32 g_dw1E84D4;
Eq_263373 g_t200000;
struct Eq_125609 * g_ptr200204;
word32 g_dw2191CC;
word32 g_dw2DC6EC;
word32 g_dw2DC71C;
Eq_195884 g_t3C0000;
ptr32 g_ptr400000;
Eq_69839 g_t4C4B40;
word32 g_dw4C4B5C;
byte g_b512E79;
word32 g_dw557344;
word32 g_dw5B8D84;
word32 g_dw5B8DB4;
word32 g_dw6ACFCC;
word32 g_dw6ACFEC;
word32 g_dw6AD00C;
word32 g_dw6DDD04;
word32 g_dw7A1224;
word32 g_dw7A1254;
word32 g_dw7A1264;
word32 g_dw989694;
Eq_275197 g_tF42400;
Eq_142773 g_tFF0000;
word32 g_dwFF0103;
byte g_bFFF804;
byte g_bFFF805;
byte g_bFFF806;
byte g_bFFF807;
Eq_2 g_tFFF83C;
struct Eq_69576 * g_ptrFFF9A8;
Eq_25374 g_tFFF9B4;
word32 g_dwFFF9F1;
Eq_10098 g_tFFFA47;
Eq_2 g_tFFFA4F;
Eq_229679 g_tFFFAC0;
Eq_2 g_tFFFB7D;
Eq_2 g_tFFFFFC;
Eq_220084 g_t100011C;
Eq_2 g_t1000389;
Eq_31100 g_t1000400;
word32 g_dw100C9AB;
word32 g_dw2000000;
struct Eq_78938 * g_ptr200006C;
Eq_2 g_t2000206;
struct Eq_30281 * g_ptr2000234;
Eq_320733 g_t2000710;
struct Eq_266666 * g_ptr200072C;
Eq_2 g_t200BFF8;
Eq_2 g_t200BFFC;
Eq_2 g_t219002F;
byte g_a2800000[129];
byte g_b2800080;
byte g_a2800400[129];
byte g_b2800407;
byte g_b2800480;
Eq_78498 g_t3000020;
struct Eq_78938 * g_ptr300006C;
Eq_2 g_t3030373;
word32 g_dw37FF1F7;
Eq_245861 g_t4000000;
word32 g_dw5000107;
Eq_2 g_t5040000;
Eq_327812 g_t6050007;
Eq_143829 g_t7000012;
Eq_143829 g_t7FFFFEC;
Eq_143349 g_t8000000;
Eq_2 g_t8100838;
Eq_104702 g_t8FFF88E;
Eq_2 g_t8FFF9F3;
ptr32 g_ptrA000008;
word32 g_dwA027FB3;
Eq_2 g_tC000000;
struct Eq_78002 * g_ptrCFFF967;
Eq_2 g_tEFFFACC;
Eq_89041 g_tF230204;
word32 g_dwF690690;
word32 g_dwF6F96FD;
word32 g_dwF76276A;
word32 g_dwF7CB7D7;
word32 g_dwF834845;
word32 g_dwF89D8B2;
word32 g_dwF90691F;
word32 g_dwF96F98C;
word32 g_dwF9D89F9;
word32 g_dwFA41A66;
word32 g_dwFAAAAD3;
word32 g_dwFB13B40;
word32 g_dwFB7CBAD;
word32 g_dwFBE5C1A;
word32 g_dwFC4EC87;
word32 g_dwFCB7CF4;
word32 g_dwFD20D61;
word32 g_dwFD89DCE;
word32 g_dwFDF2E3B;
word32 g_dwFE5BEA8;
word32 g_dwFEC4F15;
Eq_201201 g_tFFFFEA9;
Eq_25374 g_tFFFFFFF;
Eq_2 g_t10000025;
Eq_2 g_t1000008C;
struct Eq_94088 * g_ptr10325482;
struct Eq_340458 * g_ptr1032548A;
Eq_2 g_t1111111D;
Eq_2 g_t11111121;
word32 g_dw12345678;
word32 g_dw14088889;
word32 g_dw14111115;
word32 g_dw141999A2;
word32 g_dw1422222E;
word32 g_dw142AAABB;
word32 g_dw14333347;
word32 g_dw143BBBD4;
word32 g_dw14444460;
word32 g_dw144CCCED;
word32 g_dw14555579;
word32 g_dw145DDE06;
word32 g_dw14666692;
word32 g_dw146EEF1F;
word32 g_dw147777AB;
word32 g_dw14800038;
word32 g_dw148888C5;
word32 g_dw14911151;
word32 g_dw149999DE;
word32 g_dw14A2226A;
word32 g_dw14AAAAF7;
word32 g_dw14B33383;
word32 g_dw14DE38E4;
word32 g_dw14E71C76;
word32 g_dw14F00008;
word32 g_dw14F8E39A;
struct Eq_50194 * g_ptr15000194;
word32 g_dw1501C72C;
word32 g_dw150AAABF;
word32 g_dw15138E51;
word32 g_dw151C71E3;
word32 g_dw15255575;
word32 g_dw152E3908;
word32 g_dw15371C9A;
word32 g_dw1540002C;
word32 g_dw1548E3BE;
word32 g_dw1551C750;
word32 g_dw155AAAE3;
word32 g_dw15638E75;
word32 g_dw156C7207;
word32 g_dw15755599;
word32 g_dw157E392C;
Eq_2 g_t15800049;
word32 g_dw15871CBE;
word32 g_dw15900050;
Eq_456 g_t167D4685;
Eq_2 g_t19000004;
word32 g_dw190AAAAB;
word32 g_dw19155559;
word32 g_dw19200008;
word32 g_dw192AAAB7;
word32 g_dw19355565;
word32 g_dw19400014;
word32 g_dw194AAAC3;
word32 g_dw19555571;
word32 g_dw19600020;
word32 g_dw196AAACF;
word32 g_dw1975557D;
word32 g_dw1980002C;
word32 g_dw198AAADB;
word32 g_dw19955589;
word32 g_dw19A00038;
word32 g_dw19AAAAE7;
word32 g_dw19B55595;
word32 g_dw19C00044;
word32 g_dw19CAAAF3;
word32 g_dw19D555A1;
word32 g_dw19E00050;
word32 g_dw1C000204;
byte g_b1C000208;
byte g_b1C000209;
byte g_b1C00020A;
byte g_b1C00020B;
byte g_b1C00020C;
word32 g_dw1ED20D21;
word32 g_dw1EDF2DF7;
word32 g_dw1EEC4ECD;
word32 g_dw1EF96FA3;
Eq_59689 g_t1EFFF848;
word32 g_dw1F069079;
word32 g_dw1F13B14F;
word32 g_dw1F20D225;
word32 g_dw1F2DF2FB;
word32 g_dw1F3B13D1;
word32 g_dw1F4834A7;
word32 g_dw1F55557D;
word32 g_dw1F627653;
word32 g_dw1F6F9729;
word32 g_dw1F7CB7FF;
Eq_2 g_t1F83D9CB;
word32 g_dw1F89D8D6;
word32 g_dw1F96F9AC;
word32 g_dw1FA41A82;
word32 g_dw1FB13B58;
word32 g_dw1FBE5C2E;
word32 g_dw1FCB7D04;
word32 g_dw1FD89DDA;
word32 g_dw20002000;
word32 g_dw20171080;
<anonymous> * g_ptr21010810;
<anonymous> * g_ptr21010814;
<anonymous> * g_ptr21010818;
<anonymous> * g_ptr2101081C;
<anonymous> * g_ptr21010820;
<anonymous> * g_ptr21010824;
<anonymous> * g_ptr21010828;
<anonymous> * g_ptr2101082C;
<anonymous> * g_ptr21010830;
<anonymous> * g_ptr21010834;
<anonymous> * g_ptr21010838;
<anonymous> * g_ptr2101083C;
<anonymous> * g_ptr21010840;
<anonymous> * g_ptr21010844;
<anonymous> * g_ptr21010848;
<anonymous> * g_ptr2101084C;
<anonymous> * g_ptr21010850;
<anonymous> * g_ptr21010854;
<anonymous> * g_ptr21010858;
<anonymous> * g_ptr2101085C;
<anonymous> * g_ptr21010860;
<anonymous> * g_ptr21010864;
<anonymous> * g_ptr21010868;
<anonymous> * g_ptr2101086C;
<anonymous> * g_ptr21010870;
<anonymous> * g_ptr21010874;
<anonymous> * g_ptr21010878;
<anonymous> * g_ptr2101087C;
<anonymous> * g_ptr21010880;
<anonymous> * g_ptr21010884;
<anonymous> * g_ptr21010888;
<anonymous> * g_ptr2101088C;
<anonymous> * g_ptr21010890;
<anonymous> * g_ptr21010894;
<anonymous> * g_ptr21010898;
<anonymous> * g_ptr2101089C;
<anonymous> * g_ptr210108A0;
<anonymous> * g_ptr210108A4;
<anonymous> * g_ptr210108A8;
<anonymous> * g_ptr210108AC;
<anonymous> * g_ptr210108B0;
<anonymous> * g_ptr210108B4;
<anonymous> * g_ptr210108B8;
<anonymous> * g_ptr210108BC;
<anonymous> * g_ptr210108C0;
<anonymous> * g_ptr210108C4;
<anonymous> * g_ptr210108C8;
<anonymous> * g_ptr210108CC;
<anonymous> * g_ptr210108D0;
<anonymous> * g_ptr210108D4;
<anonymous> * g_ptr210108D8;
<anonymous> * g_ptr210108DC;
<anonymous> * g_ptr210108E0;
<anonymous> * g_ptr210108E4;
<anonymous> * g_ptr210108E8;
<anonymous> * g_ptr210108EC;
<anonymous> * g_ptr210108F0;
<anonymous> * g_ptr210108F4;
<anonymous> * g_ptr210108F8;
<anonymous> * g_ptr210108FC;
<anonymous> * g_ptr21010900;
<anonymous> * g_ptr21010904;
<anonymous> * g_ptr21010908;
<anonymous> * g_ptr2101090C;
<anonymous> * g_ptr21010910;
<anonymous> * g_ptr21010914;
<anonymous> * g_ptr21010918;
<anonymous> * g_ptr2101091C;
<anonymous> * g_ptr21010920;
<anonymous> * g_ptr21010924;
<anonymous> * g_ptr21010928;
<anonymous> * g_ptr2101092C;
<anonymous> * g_ptr21010930;
<anonymous> * g_ptr21010934;
<anonymous> * g_ptr21010938;
<anonymous> * g_ptr2101093C;
<anonymous> * g_ptr21010940;
<anonymous> * g_ptr21010948;
<anonymous> * g_ptr2101094C;
<anonymous> * g_ptr21010950;
<anonymous> * g_ptr21010954;
<anonymous> * g_ptr21010958;
<anonymous> * g_ptr2101095C;
<anonymous> * g_ptr21010960;
<anonymous> * g_ptr21010964;
<anonymous> * g_ptr21010968;
<anonymous> * g_ptr2101096C;
<anonymous> * g_ptr21010970;
<anonymous> * g_ptr21010974;
<anonymous> * g_ptr21010978;
<anonymous> * g_ptr2101097C;
<anonymous> * g_ptr21010980;
<anonymous> * g_ptr21010984;
<anonymous> * g_ptr21010988;
<anonymous> * g_ptr2101098C;
<anonymous> * g_ptr21010990;
<anonymous> * g_ptr21010994;
<anonymous> * g_ptr21010998;
<anonymous> * g_ptr2101099C;
<anonymous> * g_ptr210109A0;
<anonymous> * g_ptr210109A4;
<anonymous> * g_ptr210109A8;
<anonymous> * g_ptr210109AC;
<anonymous> * g_ptr210109B0;
<anonymous> * g_ptr210109B4;
<anonymous> * g_ptr210109B8;
<anonymous> * g_ptr210109BC;
<anonymous> * g_ptr210109C0;
<anonymous> * g_ptr210109C4;
<anonymous> * g_ptr210109C8;
<anonymous> * g_ptr210109CC;
<anonymous> * g_ptr210109D0;
<anonymous> * g_ptr210109D4;
<anonymous> * g_ptr210109D8;
<anonymous> * g_ptr210109DC;
<anonymous> * g_ptr210109E0;
<anonymous> * g_ptr210109E4;
<anonymous> * g_ptr210109E8;
<anonymous> * g_ptr210109EC;
<anonymous> * g_ptr210109F0;
<anonymous> * g_ptr210109F4;
<anonymous> * g_ptr210109F8;
<anonymous> * g_ptr210109FC;
<anonymous> * g_ptr21010A00;
<anonymous> * g_ptr21010A04;
<anonymous> * g_ptr21010A0C;
<anonymous> * g_ptr21010A10;
<anonymous> * g_ptr21010A14;
<anonymous> * g_ptr21010A18;
<anonymous> * g_ptr21010A1C;
<anonymous> * g_ptr21010A20;
<anonymous> * g_ptr21010A24;
<anonymous> * g_ptr21010A28;
<anonymous> * g_ptr21010A2C;
<anonymous> * g_ptr21010A30;
<anonymous> * g_ptr21010A34;
<anonymous> * g_ptr21010A38;
<anonymous> * g_ptr21010A3C;
<anonymous> * g_ptr21010A40;
<anonymous> * g_ptr21010A44;
<anonymous> * g_ptr21010A48;
<anonymous> * g_ptr21010A4C;
<anonymous> * g_ptr21010A50;
<anonymous> * g_ptr21010A54;
<anonymous> * g_ptr21010A58;
<anonymous> * g_ptr21010A5C;
<anonymous> * g_ptr21010A60;
<anonymous> * g_ptr21010A64;
<anonymous> * g_ptr21010A68;
<anonymous> * g_ptr21010A6C;
<anonymous> * g_ptr21010A70;
<anonymous> * g_ptr21010A74;
<anonymous> * g_ptr21010A78;
<anonymous> * g_ptr21010A7C;
<anonymous> * g_ptr21010A80;
<anonymous> * g_ptr21010A84;
<anonymous> * g_ptr21010A88;
<anonymous> * g_ptr21010A8C;
<anonymous> * g_ptr21010A90;
<anonymous> * g_ptr21010A94;
<anonymous> * g_ptr21010A98;
<anonymous> * g_ptr21010A9C;
<anonymous> * g_ptr21010AA0;
<anonymous> * g_ptr21010AA4;
<anonymous> * g_ptr21010AA8;
<anonymous> * g_ptr21010AAC;
<anonymous> * g_ptr21010AB0;
<anonymous> * g_ptr21010AB4;
<anonymous> * g_ptr21010AB8;
<anonymous> * g_ptr21010ABC;
word32 g_dw21638E39;
word32 g_dw2171C720;
word32 g_dw21800008;
word32 g_dw218E38F0;
word32 g_dw219C71D7;
word32 g_dw21AAAABF;
word32 g_dw21B8E3A6;
word32 g_dw21C71C8E;
word32 g_dw21D55575;
word32 g_dw21E38E5D;
word32 g_dw21F1C744;
word32 g_dw2200002C;
word32 g_dw220E3914;
word32 g_dw221C71FB;
Eq_2 g_t22222232;
word32 g_dw222AAAE3;
word32 g_dw2238E3CA;
word32 g_dw22471CB2;
word32 g_dw22555599;
word32 g_dw22638E81;
word32 g_dw2271C768;
word32 g_dw22800050;
struct Eq_173782 * g_ptr22FFF000;
word32 g_dw2328234F;
Eq_224949 g_t28440413;
Eq_144826 g_t30344645;
Eq_2 g_t30344651;
Eq_2 g_t3070DD27;
Eq_275284 g_t31313131;
Eq_2 g_t33333347;
Eq_2 g_t367CD513;
Eq_311430 g_t3C203D20;
Eq_2 g_t3C6EF382;
int32 g_dw400000A4;
int32 g_dw400000C0;
word32 g_dw400000D0;
word32 g_dw400000D4;
word32 g_dw400000D8;
word32 g_dw400000DC;
Eq_99365 g_t400000E0;
int32 g_a40000180[];
Eq_61530 g_t40001000;
int32 g_dw40001014;
int32 g_dw4000101C;
int32 g_dw40001020;
struct Eq_68737 * g_ptr40001048;
int32 g_dw40001080;
int32 g_dw40001084;
int32 g_dw4000108C;
int32 g_dw400010A0;
int32 g_dw400010A4;
Eq_68437 g_t400010A8;
Eq_68408 g_t400010AC;
int32 g_dw400010B8;
int32 g_dw400010BC;
int32 g_dw400010C0;
int32 g_dw400010C4;
int32 g_dw400010F0;
int32 g_dw40001118;
struct Eq_67404 * g_ptr4000111C;
int32 g_dw40001120;
int32 g_dw40001124;
ui32 g_a4000113C[];
int32 g_dw40001168;
int32 g_dw4000116C;
int32 g_dw40001180;
int32 g_dw40001184;
int32 g_dw40001188;
int32 g_dw4000118C;
Eq_68207 g_t40001190;
Eq_68227 g_t40001194;
Eq_68247 g_t40001198;
int32 g_dw4000119C;
int32 g_dw400011A0;
int32 g_dw400011A4;
int32 g_dw400011A8;
int32 g_dw400011AC;
int32 g_dw400011C0;
int32 g_dw400011C4;
int32 g_dw400011C8;
int32 g_dw400011CC;
int32 g_dw4000120C;
int32 g_dw40001214;
Eq_67845 g_t40001218;
int32 g_dw40001220;
Eq_99249 g_t40001224;
int32 g_dw40001228;
int32 g_dw4000123C;
int32 g_dw40001240;
int32 g_dw40001244;
int32 g_dw4000126C;
int32 g_dw40001600;
int32 g_dw4000160C;
ptr32 * g_ptr40001618;
Eq_67827 g_t4000161C;
int32 g_dw40001620;
int32 g_dw40001624;
int32 g_dw40001630;
int32 g_dw40001634;
int32 g_dw40001638;
int32 g_dw4000163C;
int32 g_dw40001640;
int32 g_dw40001700;
Eq_274530 g_t40004000;
int32 g_dw40004100;
struct Eq_167587 * g_ptr40004150;
Eq_164169 g_t40004200;
word32 * g_ptr40004208;
struct Eq_164240 * g_ptr4000420C;
struct Eq_164245 * g_ptr40004210;
struct Eq_164250 * g_ptr40004214;
struct Eq_164255 * g_ptr40004218;
struct Eq_164260 * g_ptr4000421C;
struct Eq_164204 * g_ptr40004220;
struct Eq_164205 * g_ptr40004224;
struct Eq_52584 * g_ptr4000422C;
ui32 g_dw40004230;
Eq_274503 g_t40004300;
ui32 * g_ptr40004340;
Eq_61836 g_t40007000;
uint32 g_dw40007004;
uint32 g_dw40007008;
uint32 g_dw4000700C;
uint32 g_dw40007014;
uint32 g_dw4000706C;
uint32 g_dw40007070;
uint32 g_dw40007078;
int32 g_dw4000A500;
word32 g_dw4000A540;
word32 g_dw4000A544;
word32 g_dw4000A545;
word32 g_dw4000A546;
word32 g_a4000A550[];
int32 g_dw4000A564;
uint32 g_dw4000A568;
int32 g_dw4000A584;
int32 g_dw4000A588;
int32 g_dw4000A598;
int32 g_dw4000A59C;
int32 g_dw4000A5A0;
Eq_276261 g_t4000A5BC;
byte g_b4000A700;
byte g_b4000A704;
uint16 g_w4000A708;
Eq_162400 g_t4000C000;
word32 * g_ptr4000C10C;
word32 g_dw4000C110;
word32 g_dw4000C111;
struct Eq_74127 * g_ptr4000E400;
int32 g_dw4000E404;
struct Eq_74140 * g_ptr4000E418;
int32 g_dw4000E41C;
int32 g_dw4000F814;
Eq_64837 g_t4000F884;
int32 g_dw4000F90C;
int32 g_dw4000F910;
Eq_273675 g_t4000F914;
int32 g_dw4000F938;
struct Eq_73932 * g_ptr40010814;
Eq_64723 g_t40010884;
ui32 g_dw4001090C;
ui32 g_dw40010910;
ui32 g_dw40010914;
ui32 g_dw40010938;
Eq_13346 g_t40030000;
Eq_327812 g_t410588B3;
Eq_85320 g_t4154535F;
word32 g_dw42020D8C;
Eq_2 g_t42020D90;
byte g_b42020D94;
word16 g_w42020E46;
Eq_2 g_t42020EA0;
int32 g_dw42020EA4;
Eq_2 g_t42020EA8;
Eq_2 g_t42020EAC;
Eq_2 g_t42020EB0;
byte g_b42020EB4;
Eq_2 g_t42020EBC;
word32 g_dw42020ED8;
Eq_280545 g_t42021000;
struct Eq_68737 * g_ptr43001148;
byte g_b4301901A;
byte g_b43019031;
word32 g_dw430190AC;
word32 g_dw4301910C;
byte g_b430191CA;
byte g_b430191E1;
word32 g_dw4301925C;
word32 g_dw430192BC;
word32 g_dw4301E3A8;
int32 g_dw4301EB60;
uint16 g_w4301EB98;
int32 g_dw4301EC0C;
byte g_b44047FC4;
Eq_2 g_t4444445C;
Eq_62300 g_t44800000;
ui32 g_dw44800100;
int32 g_dw44800104;
int32 g_dw44800108;
int32 g_dw4480010C;
int32 g_dw44800110;
int32 g_dw44800114;
word32 g_dw44800118;
int32 g_dw4480011C;
int32 g_dw44800140;
Eq_61834 g_t44900000;
int32 g_dw449000E0;
word32 g_dw44910040;
int32 g_a44A00080[6];
int32 g_dw44A00094;
word16 g_w44A000A4;
word16 g_w44A000AC;
struct Eq_8205 * g_ptr44B00000;
struct Eq_75239 * g_ptr44B00004;
ui32 g_dw44B00038;
uint32 g_dw44B0004C;
int32 g_dw44B00090;
int32 g_dw44B0009C;
int32 g_dw44B000A0;
byte * g_ptr44B000AC;
byte * g_ptr44B000B0;
byte * g_ptr44B000B4;
byte * g_ptr44B000B8;
Eq_9004 g_t44B000BC;
ui32 g_dw44B000C0;
Eq_8307 g_t44B000C4;
Eq_9057 g_t44B000D8;
word32 g_dw44B000DC;
Eq_78600 g_t44B000E4;
Eq_78648 g_t44B000E8;
Eq_78668 g_t44B000EC;
int32 g_dw44B000F0;
Eq_78722 g_t44B000F4;
Eq_78742 g_t44B000F8;
Eq_78763 g_t44B00104;
Eq_2 g_t44B00120;
Eq_2 g_a44B00128[];
Eq_2 g_t44B00144;
Eq_2 g_t44B00148;
Eq_2 g_t44B00200;
Eq_2 g_t44B00204;
Eq_2 g_t44B00208;
Eq_2 g_t44B0020C;
int32 g_dw44B00400;
word32 g_dw44B00404;
struct Eq_99292 * g_ptr44B00500;
struct Eq_99298 * g_ptr44B00504;
struct Eq_99318 * g_ptr44B0050C;
int32 g_dw44B00510;
Eq_16362 g_t44B08000;
struct Eq_16363 * g_ptr44B08004;
struct Eq_16363 * g_ptr44B08008;
word32 g_dw44B08080;
Eq_13963 g_t44B08084;
Eq_13963 g_t44B08088;
Eq_2 g_t44B0808C;
Eq_2 g_t44B080A4;
struct Eq_10035 * g_ptr44B080A8;
ui32 g_dw44B08160;
ui32 g_dw44B08164;
int32 g_dw44B08168;
Eq_2 g_t44B08180;
Eq_21064 g_t44B08188;
int32 g_dw44B08198;
int32 g_dw44B0819C;
int32 g_dw44B081A0;
int32 g_dw44B081A4;
int32 g_dw44B081A8;
Eq_2 g_t44B081B8;
Eq_2 g_t44B081BC;
Eq_2 g_t44B08548;
Eq_2 g_t44B0854C;
ptr32 * g_ptr44C00000;
int32 g_dw44C00818;
int32 g_dw44C0081C;
int32 g_dw44C00820;
int32 g_dw44C00824;
int32 g_dw44C00830;
Eq_63424 g_t44C00834;
int32 g_dw44C00858;
int32 g_dw44C00874;
uint32 g_dw44C01000;
word32 g_dw44C01800;
ui32 g_dw44C01818;
ui32 g_dw44C0181C;
struct Eq_63388 * g_ptr44C01820;
int32 g_dw44C01824;
ui32 g_dw44C01830;
ui32 g_dw44C01834;
int32 g_dw44C01838;
word32 g_dw44C0183C;
ui32 g_dw44C01858;
word32 g_dw44C01860;
ui32 g_dw44C01874;
word32 g_dw44C01888;
word32 g_dw44C0188C;
word32 g_dw44C01898;
word32 g_dw44C0189C;
word32 g_dw44C03030;
int32 g_dw44C0B000;
word32 g_dw44C0B118;
word32 g_dw44C0B340;
word32 g_dw44C0B344;
word32 g_dw44C0B348;
int32 g_dw44C0B364;
int32 g_dw44C0B368;
int32 g_dw44C0B36C;
int32 g_dw44C0B370;
int32 g_dw44C0B380;
int32 g_dw44C0B384;
int32 g_dw44C0B388;
int32 g_dw44C0B38C;
int32 g_dw44C0B390;
int32 g_dw44C0B394;
int32 g_dw44C0B398;
int32 g_dw44C0B3A0;
int32 g_dw44C0B3A4;
word32 g_dw44C0B3BC;
Eq_62841 g_t44C0B3C0;
int32 g_dw44C0B3C4;
int32 g_dw44C0B414;
int32 g_dw44C0B41C;
int32 g_dw44C0B420;
struct Eq_63892 ** g_ptr44C0B500;
int32 g_dw44C0C080;
int32 g_dw44C0C084;
int32 g_dw44C0C088;
int32 g_dw44C0C218;
int32 g_dw44C0C814;
int32 g_dw44C0C82C;
struct Eq_63131 * g_ptr44C0C830;
int32 g_dw44C0C838;
int32 g_dw44C0C83C;
int32 g_dw44C0C840;
ui32 g_dw44C0D814;
ui32 g_dw44C0D82C;
ui32 g_dw44C0D830;
ui32 g_dw44C0D838;
ui32 g_dw44C0D83C;
ui32 g_dw44C0D840;
Eq_456 g_t46010005;
Eq_127403 g_t4B4D2020;
word32 g_dw50100023;
Eq_224949 g_t50EF9782;
Eq_2 g_t510E5297;
Eq_63950 g_t54C0A000;
Eq_63950 g_t54C0A800;
word32 g_a54C0B000[512];
Eq_2 g_t55555571;
Eq_293029 g_t5BE0CD19;
Eq_2 g_t5BE0CD3D;
word32 g_dw5C5C5C5C;
Eq_127403 g_t619000EF;
Eq_2 g_t64F98FC7;
Eq_348359 g_t65676173;
Eq_2 g_t66666686;
struct Eq_94088 * g_ptr67452301;
struct Eq_340458 * g_ptr67452309;
Eq_2 g_t6858152D;
Eq_2 g_t6A09E66F;
Eq_268327 g_t6E6B6E75;
Eq_24791 g_t70EFFC04;
Eq_2 g_t77777777;
Eq_2 g_t7777777B;
Eq_2 g_t7777779B;
word32 g_dw7F020A53;
word32 g_dw7FFFFFDE;
struct Eq_78909 * g_ptr8000003E;
word32 g_dw80000074;
struct Eq_78909 * g_ptr800A080C;
Eq_283231 g_t8082B7FD;
Eq_127403 g_t80EFF9C5;
struct Eq_78845 * g_ptr83000198;
struct Eq_78845 * g_ptr8373F198;
word32 g_dw8373F1C0;
struct Eq_78909 * g_ptr840A080C;
Eq_456 g_t85BE8206;
Eq_267908 g_t89AE892A;
Eq_2 g_t8C49B029;
Eq_167587 g_t969F402E;
Eq_327812 g_t973200F5;
struct Eq_94088 * g_ptr98BADD06;
struct Eq_340458 * g_ptr98BADD0E;
Eq_2 g_t9B0568A8;
Eq_2 g_tA54FF54E;
word32 g_dwA6E0A6A0;
word32 g_dwA6E2A6A2;
word32 g_dwA6E7A6A7;
word32 g_dwA6EFA6AF;
word32 g_dwA6F1A6B1;
word32 g_dwA732A6EB;
word32 g_dwA734A6ED;
word32 g_dwA739A6F2;
word32 g_dwA741A6FA;
word32 g_dwA743A6FC;
word32 g_dwA7C0A77D;
word32 g_dwA7C2A77F;
word32 g_dwA7C7A784;
word32 g_dwA7D0A78C;
word32 g_dwA7D1A78E;
word32 g_dwA84FA810;
word32 g_dwA850A811;
word32 g_dwA855A816;
word32 g_dwA85EA81F;
word32 g_dwA860A821;
word32 g_dwA8DDA8A2;
word32 g_dwA8DEA8A3;
word32 g_dwA8E4A8A8;
word32 g_dwA8ECA8B1;
word32 g_dwA8EEA8B3;
word32 g_dwA96BA934;
word32 g_dwA96DA935;
word32 g_dwA972A93B;
word32 g_dwA97AA943;
word32 g_dwA97CA945;
word32 g_dwA9F9A9C6;
word32 g_dwA9FBA9C8;
word32 g_dwAA00A9CD;
word32 g_dwAA09A9D5;
word32 g_dwAA0AA9D7;
word32 g_dwAA87AA58;
word32 g_dwAA89AA5A;
word32 g_dwAA8EAA5F;
word32 g_dwAA97AA68;
word32 g_dwAA99AA6A;
Eq_2 g_tAAAAAC1B;
Eq_2 g_tAAAAAC1F;
word32 g_dwAB16AAEB;
word32 g_dwAB17AAEC;
word32 g_dwAB1CAAF1;
word32 g_dwAB25AAFA;
word32 g_dwAB27AAFC;
word32 g_dwABA4AB7D;
word32 g_dwABA5AB7E;
word32 g_dwABABAB84;
word32 g_dwABB3AB8C;
word32 g_dwABB5AB8E;
word32 g_dwAC32AC0F;
word32 g_dwAC34AC10;
word32 g_dwAC39AC16;
word32 g_dwAC42AC1E;
word32 g_dwAC43AC20;
Eq_224949 g_tAC6FD0EF;
Eq_139121 g_tB07342A1;
Eq_2 g_tBAADF00D;
struct Eq_22065 * g_ptrBADCAB1E;
Eq_2 g_tBB67AE91;
Eq_22136 g_tBDFB83F0;
byte g_bBDFE43ED;
Eq_69548 g_tBDFEE2E8;
byte g_bBDFF2FD8;
Eq_293029 g_tBEFA4FA4;
Eq_20444 g_tC0000000;
Eq_2 g_tC0DEDBAD;
Eq_2 g_tC1059EE0;
struct Eq_94088 * g_ptrC3D2E200;
struct Eq_340458 * g_ptrC3D2E208;
Eq_456 g_tC55C47F9;
Eq_327812 g_tC601C509;
Eq_327812 g_tC629C531;
Eq_224949 g_tC62A415C;
Eq_224949 g_tC64ECE06;
Eq_224949 g_tC84ACA26;
Eq_327812 g_tC9158082;
Eq_327812 g_tCA0DC915;
Eq_2 g_tCAFEBAC2;
word32 g_dwCAFEFAEE;
Eq_2 g_tCAFEFB16;
byte g_bDCF7217C;
byte g_bDCF7D274;
Eq_69338 g_tDCF88964;
Eq_69338 g_tDCF889E4;
word32 g_dwE400004B;
struct Eq_94088 * g_ptrEFCDAB8D;
struct Eq_340458 * g_ptrEFCDAB95;
Eq_71988 g_tF0000000;
struct Eq_82626 * g_ptrF0000714;
struct Eq_78223 * g_ptrF3FFF820;
word32 g_dwF4000014;
Eq_2 g_tF70E594D;
Eq_2 g_tF8FFFE04;
Eq_2 g_tFBFFFE00;
Eq_224949 g_tFDC40413;
struct Eq_77481 * g_ptrFF000684;
word32 g_dwFF6769B4;
Eq_69839 g_tFF709140;
word32 g_dwFF76ABDC;
word32 g_dwFF76AC0C;
Eq_69842 g_tFF85EE00;
word32 g_dwFF85EE24;
word32 g_dwFF85EE44;
Eq_21458 g_tFF87FFFF;
word32 g_dwFF88FB5C;
struct Eq_78909 * g_ptrFF9000C8;
word32 g_dwFF95307C;
word32 g_dwFFB3B4EC;
word32 g_dwFFBCDCD4;
Eq_2 g_tFFC00B49;
word32 g_dwFFC2F714;
word32 g_dwFFC2F744;
word32 g_dwFFC2F76C;
word32 g_dwFFD2395C;
word32 g_dwFFD2397C;
word32 g_dwFFD2399C;
word32 g_dwFFD54694;
Eq_69842 g_tFFE17B80;
word32 g_dwFFE17BB4;
Eq_101901 g_tFFF053FE;
Eq_327812 g_tFFF58693;
Eq_69417 g_tFFFFFE40;
int32 g_dwFFFFFE87;
Eq_2 g_aFFFFFFBE[];
Eq_282274 g_tFFFFFFE0;
Eq_306077 g_tFFFFFFE9;
Eq_191880 g_tFFFFFFF0;
word32 g_dwFFFFFFF2;
word32 g_dwFFFFFFF3;
struct Eq_233245 * g_ptrFFFFFFF5;
Eq_69640 g_tFFFFFFF6;
ptr32 g_ptrFFFFFFF8;
Eq_263391 g_tFFFFFFF9;
Eq_2 g_tFFFFFFFA;
Eq_213229 g_tFFFFFFFB;
Eq_44265 g_tFFFFFFFD;
Eq_2 g_tFFFFFFFE;
Eq_2 g_tFFFFFFFF;
